package com.edu.member.service;

import java.util.List;

import org.springframework.dao.DataAccessException;

import com.edu.common.util.SearchCriteria;
import com.edu.member.dto.MemberDTO;
import com.edu.product.dto.OrderDTO;

public interface MemberService {

	//-----------------------------------------------------------------------------------------------------------
	// 로그인 처리
	//-----------------------------------------------------------------------------------------------------------
	public MemberDTO login(MemberDTO memberDTO) throws DataAccessException;

	//-----------------------------------------------------------------------------------------------------------
	// 회원가입 처리하기
	//-----------------------------------------------------------------------------------------------------------
	public int addMember(MemberDTO memberDTO) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 아이디 중복 검사 => return  값을 0과 1로 받기 떄문에 정수형(int)로 설정
	//-----------------------------------------------------------------------------------------------------------
	public int idCheck(MemberDTO memberDTO) throws Exception;
	
	//----------------------------------------------------------------------------------------------------------
	// 마이페이지 아이디에 해당하는 마이페이지의 내용(비밀번호, 이름 등)을 수정 요청하기
	//----------------------------------------------------------------------------------------------------------
	public int memberUpdate(MemberDTO memberDTO);
	
	//-----------------------------------------------------------------------------------------------------------
	// 아이디에 해당하는 회원 정보 삭제하기
	//-----------------------------------------------------------------------------------------------------------
	public int removeMember(String userID) throws DataAccessException;

	//-----------------------------------------------------------------------------------------------------------
	// 전체 게시글 수 가져오기 
	//-----------------------------------------------------------------------------------------------------------
	public int memberListTotalCount3(SearchCriteria sCri) throws Exception;	
	
	//-----------------------------------------------------------------------------------------------------------
	// 검색 조건에 맞는 게시글 가져오기 
	//-----------------------------------------------------------------------------------------------------------
	public List<MemberDTO> listMembers(SearchCriteria sCri) throws Exception;

	//-----------------------------------------------------------------------------------------------------------
	// 아이디에 해당하는 회원 정보 조회 + 폼출력 - 관리자화면
	//-----------------------------------------------------------------------------------------------------------
	public MemberDTO selectMember(String userID) throws DataAccessException;

	//-----------------------------------------------------------------------------------------------------------
	// 아이디에 해당하는 회원 정보 수정하기 - 관리자 화면
	//-----------------------------------------------------------------------------------------------------------
	public int modifyMember(MemberDTO memberDTO) throws DataAccessException;

	//주문 완료 번호에 해당하는 orderDTO 리스트 구하기
	public List<OrderDTO> getOrderList(List<Long> orderNumList) throws Exception;
}
